     A*%%TS  SD  20260730  074041  BRIANHD71   REL-V7R5M0  5770-WDS
     A*===============================================================
     A* FILE NAME : dCatLookup
     A* DESCRIPTION: STOCK'N TRADE CATEGORY LOOKUP WINDOW
     A*===============================================================
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A          R LKPREC                    SFL
     A*%%TS  SD  20260729  215412  BRIANHD71   REL-V7R5M0  5770-WDS
     A            LKPOPT         1A  B  7  7VALUES('1')
     A                                      CHECK(ER)
     A            LKPNUM         4A  O  7 10
     A            LKPCAT        25A  O  7 16
     A*
     A*------------ SUBFILE CONTROL RECORD FORMAT --------------------
     A          R LKPCTL                    SFLCTL(LKPREC)
     A*%%TS  SD  20260730  074041  BRIANHD71   REL-V7R5M0  5770-WDS
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0010)
     A                                      WINDOW(2 12 21 43 *NOMSGLIN)
     A                                      CA12(12 'CANCEL')
     A                                      OVERLAY
     A  31                                  SFLDSP
     A  32                                  SFLDSPCTL
     A  33                                  SFLCLR
     A  34                                  SFLEND(*MORE)
     A*
     A                                  1 16'CATEGORY LOOKUP'
     A                                      DSPATR(HI)
     A* Search Field at the Top
     A                                  2  1'F12=Cancel'
     A                                      COLOR(BLU)
     A                                  3 19'Search..:'
     A                                      DSPATR(HI)
     A            SRCHCAT       10A  B  3 29
     A                                  4  6'1=Select'
     A                                      COLOR(BLU)
     A* Column Headers
     A                                  5  6'Opt'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  5 10'Num '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  5 16'Category Description    '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
