     A*%%TS  SD  20260922  072943  BRIANHD71   REL-V7R5M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(CS)
     A                                      PRINT
     A                                      INDARA
     A                                      CF03(03 'Exit')
     A                                      CF02(02 'Summary')
     A                                      CF05(05 'Detail')
     A                                      CF07(07 'Non-Processed')
     A*
     A          R SALOPT
     A*%%TS  SD  20260922  072943  BRIANHD71   REL-V7R5M0  5770-WDS
     A                                      BLINK
     A            TODAY         10A  O  1  2
     A            NOW            8A  O  1 73
     A* -- Title Line --
     A                                  1 30'TT Sales Reporting'
     A                                      DSPATR(HI)
     A                                  2 32'STORE:'
     A                                      DSPATR(HI)
     A            PSTORE         7A  O  2 39
     A                                  6 22'Transaction Number:'
     A                                      DSPATR(HI)
     A            DXNUM          9A  B  6 42
     A* -- Function Key Legend --
     A                                 23  1'STOCK''N TRADE'
     A                                      DSPATR(HI)
     A                                 23 18'F3=Exit   F2=Summary   F5=Detail'
     A                                      COLOR(BLU)
     A            DXDATE        10A  B  8 42
     A            DTODATE       10A  B 10 46
     A                                  8 24'Transaction Date:'
     A                                      DSPATR(HI)
     A                                 10 42'To:'
     A                                      DSPATR(HI)
     A                                 10 19'Date Range:'
     A                                      DSPATR(HI)
     A            DFRDATE       10A  B 10 31
     A                                 23 53'F7=Non Processed'
     A                                      COLOR(BLU)
     A                                 14 25'Date Format: mm/dd/yyyy'
     A                                      COLOR(BLU)
     A            MSG           60A  O 24  2DSPATR(HI)
