     A* Free Form Menu: MSTOCK
     A*%%TS  SD  20260927  232617  BRIANHD71   REL-V7R5M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R MSTOCK
     A*%%TS  SD  20260906  221041  BRIANHD71   REL-V7R5M0  5770-WDS
     A                                      DSPMOD(*DS3)
     A                                      LOCK
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                      ALWROL
     A                                      CF03
     A                                      HELP
     A                                      HOME
     A                                      HLPRTN
     A                                  1  2'MSTOCK'
     A                                      COLOR(BLU)
     A                                  3  2'Select one of the following:'
     A                                      COLOR(BLU)
     A                                  7  7'3.'
     A                                  8  7'4.'
     A* CMDPROMPT  Do not delete this DDS spec.
     A                                019  2'                                  -
     A                                          '
     A                                  1 34'Stock n Trade'
     A                                      DSPATR(HI)
     A                                 11  6'11.'
     A                                 10  6'10.'
     A                                 13  6'13.'
     A                                 13 10'Spooled'
     A                                 13 18'Files'
     A                                 14  6'90.'
     A                                 14 10'Sign'
     A                                 14 15'Off'
     A                                  5  7'1. Terminal Transactions'
     A                                  6  7'2. InStock'
     A                                  7 10'The Catalog'
     A                                 10 10'Sales Reporting'
     A                                 11 10'Stock Listing'
     A                                  8 10'Made In..'
