     A*%%***********************************************************************
     A*%%TS  RD  20260906  052558  BRIANHD71   REL-V7R5M0  5770-WDS
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*================================================================*
     A* PAGE HEADER RECORD
     A*================================================================*
     A          R HEADER
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            TODAY         10A  O     2
     A                                    55
     A                                      'TT Sales Report'
     A            NOW            8A  O   112
     A                                     1
     A                                      'TRANSACTION'
     A                                      SPACEB(002)
     A                                    55
     A                                      'STORE:'
     A            PSTORE         7A  O    63
     A                                     5
     A                                      'NUMBER'
     A                                      SPACEB(001)
     A                                    17
     A                                      'Date'
     A                                    31
     A                                      'Time'
     A                                    43
     A                                      'Total Qty'
     A                                    59
     A                                      'SubTotal'
     A                                    73
     A                                      'Discount'
     A                                    90
     A                                      'Tax'
     A                                   101
     A                                      'Total'
     A                                   110
     A                                      'Payment'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%CL 001
     A*%%***********************************************************************
     A*                                      'PRICE'
     A*================================================================*
     A* DETAIL LINE RECORD (REPEATED FOR EACH ITEM)
     A*================================================================*
     A          R DETAIL1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
      *
     A                                      SPACEB(001)
     A            PXNUM          9A  O     2
     A            PXDATE        10A  O    17
     A            PXTIME         8A  O    31
     A            PTOTQTY        3S 0O   +10
     A                                      EDTCDE(Z)
     A            PSUBTOTAL      9S 2O    57
     A                                      EDTWRD('      0.  ')
     A            PTOTDISC       9S 2O    71
     A                                      EDTWRD('      0.  -')
     A            PTAX           7S 2O    85
     A                                      EDTWRD('    0.  ')
     A            PTOTAL         9S 2O    96
     A                                      EDTWRD('      0.  ')
     A            PXPAY          6A  O   111
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A* Header 2 line for transaction items
     A          R HEADER2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                    14
     A                                      'Line'
     A                                    22
     A                                      'Item NO.'
     A                                    33
     A                                      'Description'
     A                                    82
     A                                      '  QTY'
     A                                    93
     A                                      '  Price'
     A                                   103
     A                                      '  Disc'
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*================================================================*
     A* DETAIL LINE RECORD (REPEATED FOR EACH ITEM)
     A*================================================================*
     A          R DETAIL2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
      *
     A                                      SPACEB(001)
     A            PLINE          3S 0O    15
     A                                      EDTCDE(Z)
     A            PITEM          5A  O    24
     A            PDESC         45A  O    33
     A            PQTY           3A  O    +8
     A            PPRICE         7S 2O    +3
     A                                      EDTWRD('    0.  ')
     A            PDISC          7S 2O   101
     A                                      EDTWRD('    0.  -')
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*================================================================*
     A* FOOTER RECORD (OPTIONAL TOTALS / END OF REPORT)
     A*================================================================*
     A          R FOOTER
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SPACEB(002)
     A                                     2'Page:'
     A                                     8PAGNBR
     A                                      EDTCDE(Z)
     A                                    52'*** END OF REPORT ***'
     A                                   110'STOCK''N TRADE'
     A*%%***********************************************************************
     A*%%SS
     A*%%CP+999CRTPRTF
     A*%%CP+    FILE(BRIANHD711/PSALESRPT)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       132      *N     )
     A*%%***********************************************************************
